l3chat/mk61ext/src/main.cpp
  return "RAD";
}

CalculatorAngleMode nextAngleMode(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return CalculatorAngleMode::Gradians;
    case CalculatorAngleMode::Gradians:
      return CalculatorAngleMode::Degrees;
    case CalculatorAngleMode::Degrees:
      return CalculatorAngleMode::Radians;
  }

  return CalculatorAngleMode::Radians;
}

CalculatorAngleMode previousAngleMode(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return CalculatorAngleMode::Degrees;
    case CalculatorAngleMode::Gradians:
      return CalculatorAngleMode::Radians;
    case CalculatorAngleMode::Degrees:
      return CalculatorAngleMode::Gradians;
  }

  return CalculatorAngleMode::Radians;
}

uint32_t timeoutMilliseconds(uint8_t index) {
  if (index >= kTimeoutOptionCount) {
    return kTimeoutOptions[kDefaultBacklightTimeoutIndex].milliseconds;
  }

  return kTimeoutOptions[index].milliseconds;
}

uint32_t programRunDisplayRefreshMilliseconds(uint8_t index) {
  if (index >= kProgramRunDisplayRefreshOptionCount) {
    return kProgramRunDisplayRefreshOptions[kDefaultProgramRunDisplayRefreshIndex].milliseconds;
  }

  return kProgramRunDisplayRefreshOptions[index].milliseconds;
}

const char *programRunDisplayRefreshLabel(uint8_t index) {
  if (index >= kProgramRunDisplayRefreshOptionCount) {
    return kProgramRunDisplayRefreshOptions[kDefaultProgramRunDisplayRefreshIndex].label;
  }

  return kProgramRunDisplayRefreshOptions[index].label;
}

const char *timeoutLabel(uint8_t index) {
  if (index >= kTimeoutOptionCount) {
    return kTimeoutOptions[kDefaultBacklightTimeoutIndex].label;
  }

  return kTimeoutOptions[index].label;
}

#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
uint8_t sanitizeCpuFrequencyIndex(uint8_t index) {
  if ((index >= kCpuFrequencyOptionCount) || (index < kMinimumSelectableCpuFrequencyIndex)) {
    return kDefaultCpuFrequencyIndex;
  }

  return index;
}

const char *cpuFrequencyLabel(uint8_t index) {
  return kCpuFrequencyOptions[sanitizeCpuFrequencyIndex(index)].label;
}

bool applyCpuFrequencySetting(uint8_t index) {
  index = sanitizeCpuFrequencyIndex(index);

  const CpuFrequencyOption &option = kCpuFrequencyOptions[index];
  if (clock_get_hz(clk_sys) == option.frequencyHz) {
    cpuFrequencyIndex = index;
    SystemCoreClock = option.frequencyHz;
    return true;
  }

  clock_configure(clk_sys,
                  CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                  CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
                  48 * MHZ,
                  48 * MHZ);

  pll_deinit(pll_sys);
  pll_init(pll_sys, 1, option.vcoHz, option.postDiv1, option.postDiv2);

  clock_configure(clk_ref,
                  CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC,
                  0,
                  XOSC_MHZ * MHZ,
                  XOSC_MHZ * MHZ);

  clock_configure(clk_sys,
                  CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                  CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
                  option.frequencyHz,
                  option.frequencyHz);

  clock_configure(clk_peri,
                  0,
                  CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS,
                  option.frequencyHz,
                  option.frequencyHz);

  cpuFrequencyIndex = index;
  SystemCoreClock = option.frequencyHz;
  return clock_get_hz(clk_sys) == option.frequencyHz;
}
#else
uint8_t sanitizeCpuFrequencyIndex(uint8_t) {
  return kDefaultCpuFrequencyIndex;
}

const char *cpuFrequencyLabel(uint8_t) {
  return "FIXED";
}

bool applyCpuFrequencySetting(uint8_t index) {
  cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
  return index == kDefaultCpuFrequencyIndex;
}
#endif

void applyBrightness();
void updatePowerSourceState();
void normalizeProgramEditAddress();
void rememberLastCommand(const char *label);
void rememberLastCommandForKey(char keyPressed, CalculatorPrefix prefix);
void syncPeriodicTickers();
void beginProgramRunTiming();
void finishProgramRunTiming();

void onKeyPollTimerInterrupt() {
  ++keyPollTickCount;
}

void onDisplayRefreshTimerInterrupt() {
  ++displayRefreshTickCount;
}

void configureKeyPollTicker(uint16_t intervalMs) {
  if (intervalMs == activeKeyPollIntervalMs) {
    return;
  }

  keyPollTicker.detach();
  activeKeyPollIntervalMs = intervalMs;
  if (intervalMs > 0) {
    keyPollTicker.attach(onKeyPollTimerInterrupt, std::chrono::milliseconds(intervalMs));
  }
}

void configureDisplayRefreshTicker(uint16_t intervalMs) {
  if (intervalMs == activeDisplayRefreshIntervalMs) {
    return;
  }

  displayRefreshTicker.detach();
  activeDisplayRefreshIntervalMs = intervalMs;
  if (intervalMs > 0) {
    displayRefreshTicker.attach(onDisplayRefreshTimerInterrupt, std::chrono::milliseconds(intervalMs));
  }
}

uint32_t consumeKeyPollTicks() {
  noInterrupts();
  const uint32_t pendingTicks = keyPollTickCount;
  keyPollTickCount = 0;
  interrupts();
  return pendingTicks;
}

uint32_t consumeDisplayRefreshTicks() {
  noInterrupts();
  const uint32_t pendingTicks = displayRefreshTickCount;
  displayRefreshTickCount = 0;
  interrupts();
  return pendingTicks;
}

bool hasPendingKeyPollTick() {
  return keyPollTickCount != 0;
}

bool hasPendingDisplayRefreshTick() {
  return displayRefreshTickCount != 0;
}

void syncPeriodicTickers() {
  const uint16_t keyPollIntervalMs = programRunner.isRunning() ? kKeyPollIntervalMsRun : kKeyPollIntervalMsIdle;
  configureKeyPollTicker(keyPollIntervalMs);

  uint16_t displayRefreshIntervalMs = kDisplayRefreshIntervalMsIdle;
  if (programRunner.isRunning()) {
    displayRefreshIntervalMs =
        static_cast<uint16_t>(programRunDisplayRefreshMilliseconds(programRunDisplayRefreshIndex));
  }
  configureDisplayRefreshTicker(displayRefreshIntervalMs);
}

void beginProgramRunTiming() {
  runTimingStatus.active = true;
  runTimingStatus.startMs = millis();
}

void finishProgramRunTiming() {
  if (!runTimingStatus.active) {
    return;
  }

