l3chat/mk61ext/src/main.cpp
  const uint32_t now = millis();
  runTimingStatus.active = false;
  runTimingStatus.hasLastDuration = true;
  runTimingStatus.lastDurationMs = now - runTimingStatus.startMs;
  runTimingStatus.finishedAtMs = now;
}

void clearRecentRunDurationDisplay() {
  if (runTimingStatus.active) {
    return;
  }

  runTimingStatus.hasLastDuration = false;
}

void noteUserActivity() {
  lastUserActivityMs = millis();
  backlightTimedOut = false;

  if (displaySleeping) {
    displaySleeping = false;
    display.setPowerSave(0);
  }

  applyBrightness();
}

bool isValidStoredSettings(const StoredSettings &settings) {
  if (settings.magic != kSettingsMagic) {
    return false;
  }

  if ((settings.version != kSettingsVersion) && (settings.version != kLegacySettingsVersion) &&
      (settings.version != kOlderSettingsVersion)) {
    return false;
  }

  if (settings.angleMode > static_cast<uint8_t>(CalculatorAngleMode::Degrees)) {
    return false;
  }

  if (settings.brightness > 256) {
    return false;
  }

  if (settings.backlightTimeoutIndex >= kTimeoutOptionCount) {
    return false;
  }

  if (settings.sleepTimeoutIndex >= kTimeoutOptionCount) {
    return false;
  }

  if ((settings.version == kSettingsVersion) &&
      (settings.programRunDisplayRefreshIndex >= kProgramRunDisplayRefreshOptionCount)) {
    return false;
  }

#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
  if (settings.cpuFrequencyIndex >= kCpuFrequencyOptionCount) {
    return false;
  }
#endif

  if ((settings.version != kOlderSettingsVersion) &&
      (settings.programLength > ProgramVm::kProgramCapacity)) {
    return false;
  }

  return true;
}

bool normalizeStoredSettings(StoredSettings &settings) {
  bool changed = false;

  if (settings.version == kSettingsVersion) {
    if (settings.cpuFrequencyIndex != sanitizeCpuFrequencyIndex(settings.cpuFrequencyIndex)) {
      settings.cpuFrequencyIndex = sanitizeCpuFrequencyIndex(settings.cpuFrequencyIndex);
      changed = true;
    }
    return changed;
  }

  const uint8_t previousVersion = settings.version;
  settings.version = kSettingsVersion;
  settings.programRunDisplayRefreshIndex = kDefaultProgramRunDisplayRefreshIndex;
  if (previousVersion == kOlderSettingsVersion) {
    settings.programLength = 0;
  }
  settings.cpuFrequencyIndex = sanitizeCpuFrequencyIndex(settings.cpuFrequencyIndex);
  std::memset(settings.reserved, 0, sizeof(settings.reserved));
  return true;
}

StoredSettings currentStoredSettings() {
  StoredSettings settings = defaultStoredSettings();
  settings.angleMode = static_cast<uint8_t>(calculator.angleMode());
  settings.showStackLabels = showStackLevelNames ? 1 : 0;
  settings.backlightTimeoutIndex = backlightTimeoutIndex;
  settings.sleepTimeoutIndex = sleepTimeoutIndex;
  settings.cpuFrequencyIndex = cpuFrequencyIndex;
  settings.programRunDisplayRefreshIndex = programRunDisplayRefreshIndex;
  settings.brightness = static_cast<uint16_t>(brightness);
  settings.programLength = savedProgramLength;
  return settings;
}

void applyBrightness() {
  if (displaySleeping || backlightTimedOut || (brightness <= 0)) {
    analogWrite(kBacklightPin, -1);
    digitalWrite(kBacklightPin, HIGH);  // off
  } else if (brightness >= 256) {
    analogWrite(kBacklightPin, -1);
    digitalWrite(kBacklightPin, LOW);  // on
  } else {
    analogWrite(kBacklightPin, 255 - brightness);
  }
}

void setupSupplySense() {
  analogReadResolution(kSupplyAdcResolutionBits);
}

float readSupplyVoltage() {
  uint32_t rawTotal = 0;

  // On the Pico board, A3/GPIO29 is tied to VSYS through a 1:3 divider.
  for (uint8_t sample = 0; sample < kSupplySampleCount; ++sample) {
    rawTotal += static_cast<uint32_t>(analogRead(kSupplySensePin));
  }

  const float rawAverage = static_cast<float>(rawTotal) / static_cast<float>(kSupplySampleCount);
  const float sensedVoltage = (rawAverage / static_cast<float>(kSupplyAdcMaxReading)) * kSupplyAdcReferenceVolts;
  return sensedVoltage * kSupplySenseDividerScale;
}

void updateSupplyVoltage(bool force = false) {
  const uint32_t now = millis();
  if (!force && std::isfinite(supplyVoltage) && ((now - lastSupplySampleMs) < kSupplyRefreshMs)) {
    return;
  }

  supplyVoltage = readSupplyVoltage();
  lastSupplySampleMs = now;
  updatePowerSourceState();
}

void formatSupplyVoltage(char *buffer, size_t bufferSize) {
  if (!std::isfinite(supplyVoltage)) {
    snprintf(buffer, bufferSize, "--.--V");
    return;
  }

  snprintf(buffer, bufferSize, "%.2fV", static_cast<double>(supplyVoltage));
}

int estimateBatteryPercentage() {
  if (!std::isfinite(supplyVoltage)) {
    return -1;
  }

  constexpr float kBatteryEmptyVolts = 3.30f;
  constexpr float kBatteryFullVolts = 4.20f;
  float normalized = (supplyVoltage - kBatteryEmptyVolts) / (kBatteryFullVolts - kBatteryEmptyVolts);
  if (normalized < 0.0f) {
    normalized = 0.0f;
  } else if (normalized > 1.0f) {
    normalized = 1.0f;
  }

  return static_cast<int>((normalized * 100.0f) + 0.5f);
}

void formatPowerStatus(char *buffer, size_t bufferSize) {
  formatSupplyVoltage(buffer, bufferSize);
  if (!runningOnBattery) {
    return;
  }

  const int batteryPercentage = estimateBatteryPercentage();
  if (batteryPercentage < 0) {
    return;
  }

  std::snprintf(buffer, bufferSize, "%.2fV %d%%", static_cast<double>(supplyVoltage), batteryPercentage);
}

void updatePowerSourceState() {
  if (!std::isfinite(supplyVoltage)) {
    return;
  }

  bool nextRunningOnBattery = runningOnBattery;
  if (runningOnBattery) {
    if (supplyVoltage >= kExternalPowerDetectOnVolts) {
      nextRunningOnBattery = false;
    }
  } else if (supplyVoltage <= kExternalPowerDetectOffVolts) {
    nextRunningOnBattery = true;
  }

  if (nextRunningOnBattery == runningOnBattery) {
    return;
  }

  runningOnBattery = nextRunningOnBattery;
  noteUserActivity();
}

void saveSettings(const StoredSettings &settings) {
  if (!eepromReady) {
    return;
  }

  (void)eeprom.putChanged(kSettingsEepromAddress, settings);
}

void applyStoredSettings(const StoredSettings &settings) {
  backlightTimeoutIndex = settings.backlightTimeoutIndex;
  sleepTimeoutIndex = settings.sleepTimeoutIndex;
  programRunDisplayRefreshIndex = settings.programRunDisplayRefreshIndex;
  brightness = settings.brightness;
  showStackLevelNames = settings.showStackLabels != 0;
  calculator.setAngleMode(static_cast<CalculatorAngleMode>(settings.angleMode));
  if (!applyCpuFrequencySetting(settings.cpuFrequencyIndex)) {
    (void)applyCpuFrequencySetting(kDefaultCpuFrequencyIndex);
  }

  noteUserActivity();
}

void loadSettings() {
  StoredSettings settings;
  eeprom.get(kSettingsEepromAddress, settings);

