l3chat/mk61ext/src/main.cpp
  if (!isValidStoredSettings(settings)) {
    settings = defaultStoredSettings();
    savedProgramLength = settings.programLength;
    savedProgramImageValid = false;
    applyStoredSettings(settings);
    saveSettings(settings);
    return;
  }

  const bool migrated = normalizeStoredSettings(settings);
  savedProgramLength = settings.programLength;
  savedProgramImageValid = false;
  applyStoredSettings(settings);
  if (migrated) {
    saveSettings(settings);
  }
}

bool restoreProgramFromEeprom() {
  if (!eepromReady) {
    return false;
  }

  if (savedProgramLength > ProgramVm::kProgramCapacity) {
    programVm.reset();
    savedProgramLength = 0;
    savedProgramImageValid = false;
    return false;
  }

  savedProgramImage.fill(0);
  std::array<uint8_t, ProgramVm::kProgramCapacity> programBytes{};
  for (uint16_t index = 0; index < savedProgramLength; ++index) {
    uint8_t value = 0;
    eeprom.get(kProgramEepromAddress + index, value);
    programBytes[index] = value;
    savedProgramImage[index] = value;
  }

  if (!programVm.loadProgram(programBytes.data(), savedProgramLength)) {
    programVm.reset();
    savedProgramImage.fill(0);
    savedProgramLength = 0;
    savedProgramImageValid = false;
    saveSettings(currentStoredSettings());
    return false;
  }

  savedProgramImageValid = true;
  programEditAddress = 0;
  programRecorder.reset();
  programRunner.stop();
  programRunner.clearPausedExecution();
  programRunner.resetRunAddress();
  normalizeProgramEditAddress();
  return true;
}

bool saveProgramToEeprom() {
  if (!eepromReady) {
    return false;
  }

  if (savedProgramLength > ProgramVm::kProgramCapacity) {
    return false;
  }

  if (!savedProgramImageValid && (savedProgramLength <= ProgramVm::kProgramCapacity)) {
    savedProgramImage.fill(0);
    for (uint16_t index = 0; index < savedProgramLength; ++index) {
      uint8_t value = 0;
      eeprom.get(kProgramEepromAddress + index, value);
      savedProgramImage[index] = value;
    }
    savedProgramImageValid = true;
  }

  const uint16_t length = programVm.programLength();
  const uint16_t previousSavedLength = savedProgramLength;
  const uint16_t writeLimit = (length > previousSavedLength) ? length : previousSavedLength;
  for (uint16_t index = 0; index < writeLimit; ++index) {
    const uint8_t value = (index < length) ? programVm.programByte(index) : 0;
    if (!savedProgramImageValid || (index >= previousSavedLength) || (savedProgramImage[index] != value)) {
      (void)eeprom.putChanged(kProgramEepromAddress + index, value);
    }

    savedProgramImage[index] = value;
  }

  savedProgramLength = length;
  savedProgramImageValid = true;
  saveSettings(currentStoredSettings());
  return true;
}

uint16_t increaseBrightnessValue(uint16_t value) {
  uint16_t updated = static_cast<uint16_t>(value * 2);
  if (updated > 256) {
    updated = 256;
  }
  if (updated == 0) {
    updated = 1;
  }
  return updated;
}

uint16_t decreaseBrightnessValue(uint16_t value) {
  return static_cast<uint16_t>(value / 2);
}

const char *settingsItemName(SettingsItem item) {
  switch (item) {
    case SettingsItem::Brightness:
      return "Brightness";
    case SettingsItem::BacklightTimeout:
      return "Backlight";
    case SettingsItem::SleepTimeout:
      return "Sleep";
    case SettingsItem::RunDisplayRefresh:
      return "Run screen";
    case SettingsItem::AngleMode:
      return "Angle";
    case SettingsItem::StackLabels:
      return "Labels";
    case SettingsItem::CpuFrequency:
      return "CPU freq";
  }

  return "";
}

void formatBrightnessSetting(char *buffer, size_t bufferSize, uint16_t value) {
  if (value == 0) {
    snprintf(buffer, bufferSize, "OFF");
    return;
  }

  snprintf(buffer, bufferSize, "%u", static_cast<unsigned>(value));
}

const char *stackLabelsSettingName(uint8_t showStackLabels) {
  return showStackLabels != 0 ? "ON" : "OFF";
}

void formatSettingValue(SettingsItem item,
                        const StoredSettings &settings,
                        char *buffer,
                        size_t bufferSize) {
  switch (item) {
    case SettingsItem::Brightness:
      formatBrightnessSetting(buffer, bufferSize, settings.brightness);
      return;
    case SettingsItem::BacklightTimeout:
      snprintf(buffer, bufferSize, "%s", timeoutLabel(settings.backlightTimeoutIndex));
      return;
    case SettingsItem::SleepTimeout:
      snprintf(buffer, bufferSize, "%s", timeoutLabel(settings.sleepTimeoutIndex));
      return;
    case SettingsItem::RunDisplayRefresh:
      snprintf(buffer, bufferSize, "%s", programRunDisplayRefreshLabel(settings.programRunDisplayRefreshIndex));
      return;
    case SettingsItem::AngleMode:
      snprintf(buffer,
               bufferSize,
               "%s",
               angleModeShortName(static_cast<CalculatorAngleMode>(settings.angleMode)));
      return;
    case SettingsItem::StackLabels:
      snprintf(buffer, bufferSize, "%s", stackLabelsSettingName(settings.showStackLabels));
      return;
    case SettingsItem::CpuFrequency:
      snprintf(buffer, bufferSize, "%s", cpuFrequencyLabel(settings.cpuFrequencyIndex));
      return;
  }

  buffer[0] = '\0';
}

const char *settingsItemDescription(SettingsItem item) {
  switch (item) {
    case SettingsItem::Brightness:
      return "Set the display backlight level.";
    case SettingsItem::BacklightTimeout:
      return "Switch off the backlight after inactivity on battery.";
    case SettingsItem::SleepTimeout:
      return "Put the system into energy-saving mode after inactivity on battery.";
    case SettingsItem::RunDisplayRefresh:
      return "Set screen refresh rate while programs are running.";
    case SettingsItem::AngleMode:
      return "Choose RAD, GRD, or DEG.";
    case SettingsItem::StackLabels:
      return "Show or hide the T Z Y X labels.";
    case SettingsItem::CpuFrequency:
      return "Select the RP2040 system clock frequency.";
  }

  return "";
}

void clearHelpSelection() {
  helpState.hasSelection = false;
  helpState.key = NO_KEY;
  helpState.prefix = CalculatorPrefix::None;
}

void clearPendingRegisterOperation() {
  pendingRegisterOperation = PendingRegisterOperation::None;
}

void normalizeProgramEditAddress() {
  const uint16_t length = programVm.programLength();
  if (programEditAddress > length) {
    programEditAddress = static_cast<uint8_t>(length);
  }

  if (!programVm.isStepBoundary(programEditAddress)) {
    programEditAddress = static_cast<uint8_t>(length);
  }
}

