l3chat/mk61ext/src/main.cpp
bool handleRegisterOperationKey(char keyPressed) {
  const CalculatorPrefix prefix = activeCalculatorPrefix();

  if ((prefix == CalculatorPrefix::None) && (keyPressed == 'q')) {
    armPendingRegisterOperation(PendingRegisterOperation::DirectRecall);
    return true;
  }

  if ((prefix == CalculatorPrefix::None) && (keyPressed == 'r')) {
    armPendingRegisterOperation(PendingRegisterOperation::DirectStore);
    return true;
  }

  if ((prefix == CalculatorPrefix::K) && (keyPressed == 'q')) {
    armPendingRegisterOperation(PendingRegisterOperation::IndirectRecall);
    return true;
  }

  if ((prefix == CalculatorPrefix::K) && (keyPressed == 'r')) {
    armPendingRegisterOperation(PendingRegisterOperation::IndirectStore);
    return true;
  }

  if (pendingRegisterOperation == PendingRegisterOperation::None) {
    return false;
  }

  const PendingRegisterOperation operation = pendingRegisterOperation;
  clearPendingRegisterOperation();

  uint8_t registerIndex = 0;
  if (!decodeRegisterKey(keyPressed, registerIndex)) {
    return true;
  }

  char commandBuffer[16];
  std::snprintf(commandBuffer,
                sizeof(commandBuffer),
                "%s %c",
                pendingRegisterOperationName(operation),
                registerName(registerIndex));

  switch (operation) {
    case PendingRegisterOperation::DirectRecall:
      if (calculator.recallRegister(registerIndex)) {
        rememberLastCommand(commandBuffer);
      }
      return true;
    case PendingRegisterOperation::DirectStore:
      if (calculator.storeRegister(registerIndex)) {
        rememberLastCommand(commandBuffer);
      }
      return true;
    case PendingRegisterOperation::IndirectRecall:
      if (calculator.recallIndirectRegister(registerIndex)) {
        rememberLastCommand(commandBuffer);
      }
      return true;
    case PendingRegisterOperation::IndirectStore:
      if (calculator.storeIndirectRegister(registerIndex)) {
        rememberLastCommand(commandBuffer);
      }
      return true;
    case PendingRegisterOperation::None:
      return false;
  }

  return false;
}

void handleSettingsPressedKey(char keyPressed) {
  switch (keyPressed) {
    case 'a':
      selectPreviousSettingsItem();
      rememberLastCommand("SET PREV");
      return;
    case 'b':
      selectNextSettingsItem();
      rememberLastCommand("SET NEXT");
      return;
    case 'c':
      adjustSelectedSetting(false);
      rememberLastCommand("SET -");
      return;
    case 'd':
      adjustSelectedSetting(true);
      rememberLastCommand("SET +");
      return;
    case 'e':
      exitSettingsMode();
      rememberLastCommand("SET SAVE");
      return;
    case 'f':
      cancelSettingsMode();
      rememberLastCommand("SET ESC");
      return;
    default:
      return;
  }
}

void handleProgramPressedKey(char keyPressed) {
  if ((keyPressed == 'x') && !programRecorder.hasPendingOperand() &&
      (std::strcmp(programRecorder.activePrefixName(), "F") == 0)) {
    exitProgramMode();
    rememberLastCommand("RUN");
    return;
  }

  if (!programRecorder.hasPendingOperand() && (programRecorder.activePrefixName()[0] == '\0')) {
    if (keyPressed == 'g') {
      (void)saveProgramToEeprom();
      rememberLastCommand("SAVE PRG");
      return;
    }

    if (keyPressed == 'h') {
      (void)restoreProgramFromEeprom();
      rememberLastCommand("LOAD PRG");
      return;
    }
  }

  (void)programRecorder.handleKey(programVm, programEditAddress, keyPressed);
}

void handlePressedKey(char keyPressed) {
  const bool runControlContext =
      (pendingRegisterOperation == PendingRegisterOperation::None) &&
      (activeCalculatorPrefix() == CalculatorPrefix::None);

  if (settingsState.active) {
    handleSettingsPressedKey(keyPressed);
    return;
  }

  if (programRunner.isRunning()) {
    if (runControlContext && (keyPressed == 'o')) {
      programRunner.stop();
      finishProgramRunTiming();
      rememberLastCommand("STOP");
    }
    return;
  }

  if (keyPressed == 'f') {
    toggleHelpMode();
    rememberLastCommand(helpState.enabled ? "HELP ON" : "HELP OFF");
    return;
  }

  if (helpState.enabled) {
    handleHelpPressedKey(keyPressed);
    return;
  }

  if (programMode) {
    handleProgramPressedKey(keyPressed);
    return;
  }

  if ((activeCalculatorPrefix() == CalculatorPrefix::F) && (keyPressed == 'y')) {
    enterProgramMode();
    rememberLastCommand("PRG");
    return;
  }

  if (keyPressed == 'e') {
    enterSettingsMode();
    rememberLastCommand("SETTINGS");
    return;
  }

  if (runControlContext && (keyPressed == 'o')) {
    (void)programRunner.start(programVm, calculator);
    if (programRunner.isRunning()) {
      beginProgramRunTiming();
      rememberLastCommand("RUN");
    }
    return;
  }

  if (runControlContext && (keyPressed == 'n')) {
    programRunner.resetRunAddress();
    rememberLastCommand("PC 00");
    return;
  }

  if (runControlContext && (keyPressed == 't')) {
    if (programRunner.singleStep(programVm, calculator)) {
      rememberLastCommand("SST");
    }
    return;
  }

  if (runControlContext && (keyPressed == 'g')) {
    (void)saveProgramToEeprom();
    rememberLastCommand("SAVE PRG");
    return;
  }

  if (runControlContext && (keyPressed == 'h')) {
    (void)restoreProgramFromEeprom();
    rememberLastCommand("LOAD PRG");
    return;
  }

  programRunner.clearError();

  if (handleRegisterOperationKey(keyPressed)) {
    programRunner.clearPausedExecution();
    return;
  }

  const CalculatorPrefix prefixBefore = activeCalculatorPrefix();
  const CalculatorAction action = translateKeyToCalculatorAction(keyPressed);
  if (action != CalculatorAction::None) {
    programRunner.clearPausedExecution();
    rememberLastCommandForKey(keyPressed, prefixBefore);
  }
  calculator.apply(action);
}

void updateInput() {
  const bool keyActivity = keypad.getKeys();
  std::array<char, kRowCount * kColumnCount> pressedKeys{};
  size_t pressedKeyCount = 0;

  for (byte index = 0; index < keypad.numKeys(); index++) {
    const Key &key = keypad.key[index];

    if (!keyActivity) {
      continue;
    }

    if (key.stateChanged) {
      keypadDiagnostics.lastKey = key.kchar;
      keypadDiagnostics.lastState = key.kstate;
      keypadDiagnostics.hasEvent = true;
      keypadDiagnostics.lastEventMillis = millis();

      if ((key.kstate == PRESSED) && (pressedKeyCount < pressedKeys.size())) {
        pressedKeys[pressedKeyCount++] = key.kchar;
      }
    }
  }

