l3chat/mk61ext/src/main.cpp
  if (pressedKeyCount == 0) {
    return;
  }

  clearRecentRunDurationDisplay();

  const bool wasSleeping = displaySleeping;
  noteUserActivity();
  if (wasSleeping) {
    return;
  }

  for (size_t index = 0; index < pressedKeyCount; ++index) {
    const char key = pressedKeys[index];
    if ((key == 'k') || (key == 'p')) {
      handlePressedKey(key);
    }
  }

  for (size_t index = 0; index < pressedKeyCount; ++index) {
    const char key = pressedKeys[index];
    if ((key != 'k') && (key != 'p')) {
      handlePressedKey(key);
    }
  }
}

void updateProgramExecution() {
  if (!programRunner.isRunning()) {
    return;
  }

  // Keep stepping until a timer interrupt requests key processing or a display refresh.
  while (programRunner.isRunning()) {
    (void)programRunner.step(programVm, calculator);

    if (!programRunner.isRunning()) {
      break;
    }

    if (hasPendingKeyPollTick() || hasPendingDisplayRefreshTick()) {
      break;
    }
  }

  if (!programRunner.isRunning()) {
    finishProgramRunTiming();
  }

  lastUserActivityMs = millis();
}

void updateIdlePowerState() {
  if (settingsState.active) {
    return;
  }

  if (programRunner.isRunning()) {
    return;
  }

  if (!runningOnBattery) {
    return;
  }

  const uint32_t idleMs = millis() - lastUserActivityMs;
  const uint32_t sleepTimeoutMs = timeoutMilliseconds(sleepTimeoutIndex);
  if (!displaySleeping && (sleepTimeoutMs > 0) && (idleMs >= sleepTimeoutMs)) {
    displaySleeping = true;
    backlightTimedOut = true;
    display.setPowerSave(1);
    applyBrightness();
    return;
  }

  const uint32_t backlightTimeoutMs = timeoutMilliseconds(backlightTimeoutIndex);
  if (!displaySleeping && !backlightTimedOut && (backlightTimeoutMs > 0) &&
      (idleMs >= backlightTimeoutMs)) {
    backlightTimedOut = true;
    applyBrightness();
  }
}

void formatStackValue(CalculatorValue value, char *buffer, size_t bufferSize, int precision) {
  const CalculatorValue normalizedValue = (std::fabs(value) < 1e-12) ? 0.0 : value;
  snprintf(buffer, bufferSize, "%.*g", precision, normalizedValue);
}

void drawRightAlignedText(int rightEdge, int y, const char *text) {
  display.drawStr(rightEdge - display.getStrWidth(text), y, text);
}

void formatStackValueToFit(CalculatorValue value,
                           char *buffer,
                           size_t bufferSize,
                           int maxPixelWidth) {
  for (int precision = kStackValueMaxPrecision; precision >= 1; --precision) {
    formatStackValue(value, buffer, bufferSize, precision);
    if (display.getStrWidth(buffer) <= maxPixelWidth) {
      return;
    }
  }

  formatStackValue(value, buffer, bufferSize, 1);
}

void drawStackTextLine(int y, const char *label, const char *text) {
  display.setFont(u8g2_font_6x10_mr);
  if ((label != nullptr) && (label[0] != '\0')) {
    display.drawStr(0, y, label);
  }
  drawRightAlignedText(kDisplayWidth - 1, y, text);
}

void drawStackLine(int y, const char *label, CalculatorValue value) {
  char valueBuffer[32];

  display.setFont(u8g2_font_6x10_mr);
  const int labelWidth = ((label != nullptr) && (label[0] != '\0')) ? display.getStrWidth(label) : 0;
  const int gap = (labelWidth > 0) ? kStackValueMinGap : 0;
  const int maxValueWidth = kDisplayWidth - labelWidth - gap;
  formatStackValueToFit(value, valueBuffer, sizeof(valueBuffer), maxValueWidth);
  drawStackTextLine(y, label, valueBuffer);
}

void formatXDisplayToFit(char *buffer, size_t bufferSize, int maxPixelWidth) {
  for (int precision = kStackValueMaxPrecision; precision >= 1; --precision) {
    calculator.formatXForDisplay(buffer, bufferSize, precision);
    if (display.getStrWidth(buffer) <= maxPixelWidth) {
      return;
    }
  }

  calculator.formatXForDisplay(buffer, bufferSize, 1);
}

void setupDisplay() {
  brightness = 0;
  pinMode(kBacklightPin, OUTPUT);
  applyBrightness();

  // Keep legacy software-SPI pins electrically quiet when the LCD is rewired to hardware SPI.
  pinMode(kLegacyDisplayClockPin, INPUT);
  pinMode(kLegacyDisplayDataPin, INPUT);

#if MK61EXT_SERIAL_DEBUG
  Serial.println("[mk61ext] display: begin()");
#endif
  display.begin();
  display.setPowerSave(0);
  display.setFlipMode(1);
  display.setContrast(kDisplayContrast);
  display.setFont(u8g2_font_t0_15b_mr);
  display.setFontRefHeightExtendedText();
  display.setDrawColor(1);
  display.setFontPosTop();
  display.setFontDirection(0);
#if MK61EXT_SERIAL_DEBUG
  Serial.println("[mk61ext] display: configured");
#endif
}

void setupEeprom() {
  eepromWire.setClock(kEepromClockHz);
  eepromWire.begin();

  if (!eeprom.begin(kEepromAddress, eepromWire)) {
#if MK61EXT_SERIAL_DEBUG
    Serial.println("[mk61ext] eeprom: not found");
#endif
    display.drawStr(0, 0, "no memory found");
    while (true) {
      delay(1);
    }
  }

  display.drawStr(0, 0, "  memory found");
  eeprom.setMemorySize(262144 / 8);  // EEPROM is the AT24C256 (256 Kbit = 32768 bytes)
  eeprom.setPageSize(64);
  eeprom.setPageWriteTime(3);
  eeprom.disablePollForWriteComplete();
  eepromReady = true;
#if MK61EXT_SERIAL_DEBUG
  Serial.println("[mk61ext] eeprom: ready");
#endif
}

const char *calculatorModeName() {
  if (calculator.hasError()) {
    return "ERR";
  }

  if (calculator.isEnteringExponent()) {
    return "EEX";
  }

  if (calculator.isEntering()) {
    return "ENT";
  }

  return "CALC";
}

const char *programRecorderErrorShortName(ProgramRecorderError error) {
  switch (error) {
    case ProgramRecorderError::None:
      return "";
    case ProgramRecorderError::InvalidKey:
      return "KEY";
    case ProgramRecorderError::InvalidOperand:
      return "OPR";
    case ProgramRecorderError::CommitFailed:
      return "MEM";
  }

  return "ERR";
}

void rememberLastCommand(const char *label) {
  if ((label == nullptr) || (label[0] == '\0')) {
    return;
  }

  commandStatus.hasLast = true;
  std::snprintf(commandStatus.last, sizeof(commandStatus.last), "%s", label);
}

const char *commandLabelForKey(char keyPressed, CalculatorPrefix prefix) {
  const CalculatorKeyAssignment *assignment = plannedCalculatorKeyAssignment(keyPressed);
  if (assignment == nullptr) {
    return nullptr;
  }

  switch (prefix) {
    case CalculatorPrefix::F:
      return assignment->fShifted;
    case CalculatorPrefix::K:
      return assignment->kShifted;
    case CalculatorPrefix::None:
      return assignment->primary;
  }

  return nullptr;
}

void rememberLastCommandForKey(char keyPressed, CalculatorPrefix prefix) {
  const char *label = commandLabelForKey(keyPressed, prefix);
  if ((label == nullptr) || (label[0] == '\0')) {
    return;
  }

  rememberLastCommand(label);
}

bool formatCommandProgress(char *buffer, size_t bufferSize) {
  if (pendingRegisterOperation != PendingRegisterOperation::None) {
    std::snprintf(buffer, bufferSize, "IN %s ?", pendingRegisterOperationName());
    return true;
  }

  const char *prefixName = activeCalculatorPrefixName();
  if (prefixName[0] != '\0') {
    std::snprintf(buffer, bufferSize, "IN %s ?", prefixName);
    return true;
  }

