l3chat/mk61ext/src/main.cpp
  return false;
}

bool formatProgramPendingInput(char *buffer, size_t bufferSize) {
  char pendingBytes[16];
  char pendingDecoded[32];
  if (!programRecorder.formatPendingPreview(
          pendingBytes, sizeof(pendingBytes), pendingDecoded, sizeof(pendingDecoded))) {
    return false;
  }

  const char *separator = std::strchr(pendingDecoded, ' ');
  if (separator == nullptr) {
    char shortDecoded[9];
    std::snprintf(shortDecoded, sizeof(shortDecoded), "%.8s", pendingDecoded);
    std::snprintf(buffer, bufferSize, "IN %s ?", shortDecoded);
    return true;
  }

  char mnemonic[9];
  const size_t mnemonicLength = static_cast<size_t>(separator - pendingDecoded);
  const size_t copyLength = (mnemonicLength < (sizeof(mnemonic) - 1)) ? mnemonicLength : (sizeof(mnemonic) - 1);
  std::memcpy(mnemonic, pendingDecoded, copyLength);
  mnemonic[copyLength] = '\0';

  const char *operand = separator + 1;
  if (operand[0] == '\0') {
    std::snprintf(buffer, bufferSize, "IN %s ?", mnemonic);
    return true;
  }

  char operandBuffer[5];
  size_t operandIndex = 0;
  for (size_t sourceIndex = 0;
       (operand[sourceIndex] != '\0') && (operandIndex < (sizeof(operandBuffer) - 1));
       ++sourceIndex) {
    char token = operand[sourceIndex];
    if (token == '_') {
      token = '?';
    }
    if (token == ' ') {
      continue;
    }
    operandBuffer[operandIndex++] = token;
  }
  operandBuffer[operandIndex] = '\0';

  if ((std::strcmp(operandBuffer, "??") == 0) || (std::strcmp(operandBuffer, "?") == 0)) {
    std::snprintf(buffer, bufferSize, "IN %s ?", mnemonic);
  } else {
    std::snprintf(buffer, bufferSize, "IN %s %s", mnemonic, operandBuffer);
  }

  return true;
}

bool formatProgramLastCommand(char *buffer, size_t bufferSize) {
  uint8_t previousAddress = 0;
  if (!programVm.previousStepAddress(programEditAddress, previousAddress)) {
    return false;
  }

  const ProgramVm::DecodedStep previousStep = programVm.decodeAt(previousAddress);
  char decodedBuffer[24];
  if (!programVm.formatStep(previousStep, decodedBuffer, sizeof(decodedBuffer))) {
    return false;
  }

  std::snprintf(buffer, bufferSize, "CMD %.12s", decodedBuffer);
  return true;
}

bool formatRecentRunDuration(char *buffer, size_t bufferSize) {
  if (runTimingStatus.active || !runTimingStatus.hasLastDuration) {
    return false;
  }

  const unsigned long elapsedMs = static_cast<unsigned long>(runTimingStatus.lastDurationMs);
  if (elapsedMs < 1000ul) {
    std::snprintf(buffer, bufferSize, "RUN %lums", elapsedMs);
    return true;
  }

  if (elapsedMs < 60000ul) {
    const unsigned long seconds = elapsedMs / 1000ul;
    const unsigned long centiseconds = (elapsedMs % 1000ul) / 10ul;
    std::snprintf(buffer, bufferSize, "RUN %lu.%02lus", seconds, centiseconds);
    return true;
  }

  const unsigned long minutes = elapsedMs / 60000ul;
  const unsigned long seconds = (elapsedMs / 1000ul) % 60ul;
  std::snprintf(buffer, bufferSize, "RUN %lum%02lus", minutes, seconds);
  return true;
}

void formatStatusRightText(char *buffer, size_t bufferSize) {
  if (formatRecentRunDuration(buffer, bufferSize)) {
    return;
  }

  if (formatCommandProgress(buffer, bufferSize)) {
    return;
  }

  if (commandStatus.hasLast) {
    std::snprintf(buffer, bufferSize, "CMD %.12s", commandStatus.last);
    return;
  }

  formatPowerStatus(buffer, bufferSize);
}

void drawStatusBar() {
  char leftBuffer[32];
  char rightBuffer[18];
  rightBuffer[0] = '\0';
  const unsigned runAddress = static_cast<unsigned>(programRunner.runAddress());

  if (settingsState.active) {
    snprintf(leftBuffer, sizeof(leftBuffer), "SET");
    snprintf(rightBuffer, sizeof(rightBuffer), "e OK f ESC");
  } else if (helpState.enabled) {
    if (helpState.hasSelection) {
      const char *label = calculatorKeyHelpLabel(helpState.key, helpState.prefix);
      snprintf(leftBuffer, sizeof(leftBuffer), "HELP: %s", label);
    } else {
      snprintf(leftBuffer, sizeof(leftBuffer), "HELP");
    }
  } else if (programMode) {
    const char *recorderErrorShort = programRecorderErrorShortName(programRecorder.error());
    const char *recorderPrefix = programRecorder.activePrefixName();
    const char *editModeShort = programRecorder.insertModeEnabled() ? "INS" : "OVR";
    const unsigned editAddress = static_cast<unsigned>(programEditAddress);
    char programStateBuffer[24];
    programStateBuffer[0] = '\0';
    if (recorderErrorShort[0] != '\0') {
      snprintf(programStateBuffer, sizeof(programStateBuffer), "E:%s", recorderErrorShort);
    } else if (formatProgramPendingInput(programStateBuffer, sizeof(programStateBuffer))) {
      // Program state already formatted as an unfinished command string.
    } else if (recorderPrefix[0] != '\0') {
      snprintf(programStateBuffer, sizeof(programStateBuffer), "IN %s ?", recorderPrefix);
    } else if (!formatProgramLastCommand(programStateBuffer, sizeof(programStateBuffer))) {
      programStateBuffer[0] = '\0';
    }

    if (programStateBuffer[0] != '\0') {
      snprintf(leftBuffer, sizeof(leftBuffer), "P%02X %s %s", editAddress, editModeShort, programStateBuffer);
    } else {
      snprintf(leftBuffer, sizeof(leftBuffer), "P%02X %s", editAddress, editModeShort);
    }
    formatPowerStatus(rightBuffer, sizeof(rightBuffer));
  } else if (programRunner.hasError()) {
    snprintf(leftBuffer,
             sizeof(leftBuffer),
             "PC%02X VM %s",
             runAddress,
             programRunnerErrorShortName(programRunner.error()));
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (programRunner.isRunning()) {
    snprintf(leftBuffer, sizeof(leftBuffer), "PC%02X RUN", runAddress);
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (calculator.hasError()) {
    snprintf(leftBuffer, sizeof(leftBuffer), "PC%02X ERR %s", runAddress, calculator.errorMessage());
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (pendingRegisterOperation != PendingRegisterOperation::None) {
    snprintf(leftBuffer,
             sizeof(leftBuffer),
             "PC%02X %s %s",
             runAddress,
             angleModeShortName(calculator.angleMode()),
             pendingRegisterOperationName());
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else {
    const char *prefixName = activeCalculatorPrefixName();
    if (prefixName[0] != '\0') {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "PC%02X %s %s %s",
               runAddress,
               prefixName,
               angleModeShortName(calculator.angleMode()),
               calculatorModeName());
    } else {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "PC%02X %s %s",
               runAddress,
               angleModeShortName(calculator.angleMode()),
               calculatorModeName());
    }
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  }

  display.setFont(u8g2_font_5x7_mr);
  display.drawBox(0, 0, kDisplayWidth, kStatusBarHeight);
  display.setDrawColor(0);
  display.drawStr(2, 1, leftBuffer);
  if ((rightBuffer[0] != '\0') &&
      ((display.getStrWidth(leftBuffer) + display.getStrWidth(rightBuffer) + 6) < kDisplayWidth)) {
    drawRightAlignedText(kDisplayWidth - 2, 1, rightBuffer);
  }
  display.setDrawColor(1);
}

void drawWrappedText(int x,
                     int y,
                     const char *text,
                     int maxPixelWidth,
                     uint8_t maxLines,
                     int lineHeight) {
  char lineBuffer[64];
  size_t position = 0;

