l3chat/mk61ext/src/main.cpp
  for (uint8_t line = 0; line < maxLines; ++line) {
    while (text[position] == ' ') {
      ++position;
    }

    if (text[position] == '\0') {
      return;
    }

    const size_t lineStart = position;
    size_t lineEnd = lineStart;
    size_t lastSpace = static_cast<size_t>(-1);
    size_t lastFittingEnd = lineStart;

    while ((text[position] != '\0') && (text[position] != '\n')) {
      if (text[position] == ' ') {
        lastSpace = position;
      }

      const size_t nextLength = (position - lineStart) + 1;
      if (nextLength >= sizeof(lineBuffer)) {
        break;
      }

      std::memcpy(lineBuffer, text + lineStart, nextLength);
      lineBuffer[nextLength] = '\0';
      if (display.getStrWidth(lineBuffer) > maxPixelWidth) {
        break;
      }

      lastFittingEnd = position + 1;
      ++position;
    }

    if (text[position] == '\n') {
      lineEnd = position;
      ++position;
    } else if (text[position] == '\0') {
      lineEnd = position;
    } else if ((lastSpace != static_cast<size_t>(-1)) && (lastSpace >= lineStart) && (lastSpace < lastFittingEnd)) {
      lineEnd = lastSpace;
      position = lastSpace + 1;
    } else if (lastFittingEnd > lineStart) {
      lineEnd = lastFittingEnd;
      position = lastFittingEnd;
    } else {
      lineEnd = position + 1;
      ++position;
    }

    size_t lineLength = lineEnd - lineStart;
    if (lineLength >= sizeof(lineBuffer)) {
      lineLength = sizeof(lineBuffer) - 1;
    }

    std::memcpy(lineBuffer, text + lineStart, lineLength);
    lineBuffer[lineLength] = '\0';
    display.drawStr(x, y + (line * lineHeight), lineBuffer);
  }
}

void drawCharacterWrappedText(int x,
                              int y,
                              const char *text,
                              int maxPixelWidth,
                              uint8_t maxLines,
                              int lineHeight) {
  if (text == nullptr) {
    return;
  }

  char lineBuffer[64];
  size_t position = 0;

  for (uint8_t line = 0; line < maxLines; ++line) {
    if (text[position] == '\0') {
      return;
    }

    if (text[position] == '\n') {
      ++position;
      continue;
    }

    const size_t lineStart = position;
    size_t lineEnd = lineStart;

    while ((text[position] != '\0') && (text[position] != '\n')) {
      const size_t nextLength = (position - lineStart) + 1;
      if (nextLength >= sizeof(lineBuffer)) {
        break;
      }

      std::memcpy(lineBuffer, text + lineStart, nextLength);
      lineBuffer[nextLength] = '\0';
      if (display.getStrWidth(lineBuffer) > maxPixelWidth) {
        break;
      }

      lineEnd = position + 1;
      ++position;
    }

    if (text[position] == '\n') {
      lineEnd = position;
      ++position;
    } else if (lineEnd == lineStart) {
      lineEnd = lineStart + 1;
      position = lineEnd;
    }

    size_t lineLength = lineEnd - lineStart;
    if (lineLength >= sizeof(lineBuffer)) {
      lineLength = sizeof(lineBuffer) - 1;
    }

    std::memcpy(lineBuffer, text + lineStart, lineLength);
    lineBuffer[lineLength] = '\0';
    display.drawStr(x, y + (line * lineHeight), lineBuffer);
  }
}

const char *currentHelpDescription() {
  if (!helpState.hasSelection) {
    return "Press any key to see its meaning. Use k or p first to inspect F or K shifts. Press f again to leave help.";
  }

  return calculatorKeyHelpDescription(helpState.key, helpState.prefix);
}

void drawHelpScreen() {
  drawStatusBar();
  display.setFont(u8g2_font_5x7_mr);
  drawCharacterWrappedText(
      0, kHelpBodyY, currentHelpDescription(), kHelpTextWidth, kHelpBodyLineCount, kHelpLineHeight);
}

void drawSettingsRow(int y, bool selected, uint8_t index, const char *label, const char *value) {
  char leftBuffer[32];

  if (selected) {
    display.drawBox(0, y, kSettingsCursorBoxWidth, 7);
    display.setDrawColor(0);
    display.drawStr(1, y, ">");
    display.setDrawColor(1);
  }

  snprintf(leftBuffer, sizeof(leftBuffer), "%u. %s", static_cast<unsigned>(index + 1), label);
  display.drawStr(kSettingsCursorBoxWidth + 2, y, leftBuffer);
  drawRightAlignedText(kDisplayWidth - 1, y, value);
}

void drawSettingsScreen() {
  char valueBuffer[16];

  drawStatusBar();
  display.setFont(u8g2_font_5x7_mr);
  for (uint8_t index = 0; index < kSettingsItemCount; ++index) {
    const SettingsItem item = kSettingsItems[index];
    formatSettingValue(item, settingsState.stagedSettings, valueBuffer, sizeof(valueBuffer));
    drawSettingsRow(kSettingsFirstRowY + (index * kSettingsRowHeight),
                    settingsState.selectedIndex == index,
                    index,
                    settingsItemName(item),
                    valueBuffer);
  }

  display.setFont(u8g2_font_4x6_mr);
  const int settingsRowsBottom = kSettingsFirstRowY + ((kSettingsItemCount - 1) * kSettingsRowHeight) + 7;
  if ((settingsRowsBottom + kSettingsDescriptionLineHeight) <= 64) {
    drawWrappedText(0,
                    kSettingsDescriptionY,
                    settingsItemDescription(kSettingsItems[settingsState.selectedIndex]),
                    kHelpTextWidth,
                    kSettingsDescriptionLineCount,
                    kSettingsDescriptionLineHeight);
  }
}

void drawProgramScreen() {
  std::array<uint16_t, ProgramVm::kProgramCapacity + 1> listingAddresses{};
  uint16_t listingCount = 0;
  uint16_t cursor = 0;
  const uint16_t programLength = programVm.programLength();

  normalizeProgramEditAddress();
  cursor = 0;

  while ((cursor < programLength) && (listingCount < ProgramVm::kProgramCapacity)) {
    listingAddresses[listingCount++] = cursor;

    const ProgramVm::DecodedStep step = programVm.decodeAt(static_cast<uint8_t>(cursor));
    const uint16_t stepWidth = (step.width > 0) ? step.width : 1;
    const uint16_t next = cursor + stepWidth;
    if ((next <= cursor) || (next > programLength)) {
      cursor = programLength;
    } else {
      cursor = next;
    }
  }

  listingAddresses[listingCount++] = programLength;

