l3chat/mk61ext/src/main.cpp
  uint16_t cursorIndex = listingCount - 1;
  for (uint16_t index = 0; index < listingCount; ++index) {
    if (listingAddresses[index] == static_cast<uint16_t>(programEditAddress)) {
      cursorIndex = index;
      break;
    }
  }

  uint16_t firstVisible = 0;
  if (listingCount > static_cast<uint16_t>(kProgramListVisibleRows)) {
    const uint16_t halfWindow = static_cast<uint16_t>(kProgramListVisibleRows / 2);
    if (cursorIndex > halfWindow) {
      firstVisible = cursorIndex - halfWindow;
    }

    const uint16_t maxFirstVisible = listingCount - kProgramListVisibleRows;
    if (firstVisible > maxFirstVisible) {
      firstVisible = maxFirstVisible;
    }
  }

  drawStatusBar();

  display.setFont(u8g2_font_5x7_mr);
  for (uint8_t row = 0; row < kProgramListVisibleRows; ++row) {
    const uint16_t lineIndex = firstVisible + row;
    if (lineIndex >= listingCount) {
      break;
    }

    const uint16_t lineAddress = listingAddresses[lineIndex];
    const bool isCursorLine = lineAddress == static_cast<uint16_t>(programEditAddress);

    char listingBuffer[64];
    bool hasPendingPreviewLine = false;
    if (isCursorLine) {
      char pendingBytes[16];
      char pendingDecoded[32];
      if (programRecorder.formatPendingPreview(
              pendingBytes, sizeof(pendingBytes), pendingDecoded, sizeof(pendingDecoded))) {
        snprintf(listingBuffer,
                 sizeof(listingBuffer),
                 "%02X: %-8s%s",
                 static_cast<unsigned>(lineAddress),
                 pendingBytes,
                 pendingDecoded);
        hasPendingPreviewLine = true;
      }
    }

    if (!hasPendingPreviewLine) {
      if (lineAddress == programLength) {
        snprintf(listingBuffer, sizeof(listingBuffer), "%02X: --      END", static_cast<unsigned>(lineAddress));
      } else if (!programVm.formatListingLine(static_cast<uint8_t>(lineAddress),
                                              listingBuffer,
                                              sizeof(listingBuffer))) {
        snprintf(listingBuffer, sizeof(listingBuffer), "%02X: --      END", static_cast<unsigned>(lineAddress));
      }
    }

    char rowBuffer[72];
    snprintf(rowBuffer, sizeof(rowBuffer), "%c%s", isCursorLine ? '>' : ' ', listingBuffer);
    display.drawStr(0, kProgramListFirstY + (row * kProgramListRowHeight), rowBuffer);
  }
}

void drawCalculatorScreen() {
  const CalculatorStack stack = calculator.stack();
  char xBuffer[RpnCalculator::kEntryBufferSize];
  const char *tLabel = showStackLevelNames ? "T:" : "";
  const char *zLabel = showStackLevelNames ? "Z:" : "";
  const char *yLabel = showStackLevelNames ? "Y:" : "";

  drawStatusBar();

  drawStackLine(kStackFirstY + (0 * kStackRowHeight), tLabel, stack.t);
  drawStackLine(kStackFirstY + (1 * kStackRowHeight), zLabel, stack.z);
  drawStackLine(kStackFirstY + (2 * kStackRowHeight), yLabel, stack.y);
  display.setFont(u8g2_font_6x10_mr);
  const char *xLabel = showStackLevelNames ? (calculator.isEntering() ? "X>" : "X:") : "";
  const int labelWidth = (xLabel[0] != '\0') ? display.getStrWidth(xLabel) : 0;
  const int gap = (labelWidth > 0) ? kStackValueMinGap : 0;
  const int maxValueWidth = kDisplayWidth - labelWidth - gap;
  formatXDisplayToFit(xBuffer, sizeof(xBuffer), maxValueWidth);
  drawStackTextLine(kStackFirstY + (3 * kStackRowHeight), xLabel, xBuffer);
}

void sendDisplayIfFrameChanged() {
  const uint8_t *frameBuffer = display.getBufferPtr();
  if (frameBuffer == nullptr) {
    return;
  }

  const bool frameChanged =
      !hasPreviousDisplayFrame ||
      (std::memcmp(previousDisplayFrame.data(), frameBuffer, previousDisplayFrame.size()) != 0);
  if (!frameChanged) {
    return;
  }

  std::memcpy(previousDisplayFrame.data(), frameBuffer, previousDisplayFrame.size());
  hasPreviousDisplayFrame = true;
  display.sendBuffer();
}

}  // namespace

void setup() {
#if MK61EXT_SERIAL_DEBUG
  Serial.begin(kSerialBaudRate);
  const uint32_t serialWaitStartMs = millis();
  while (!Serial && ((millis() - serialWaitStartMs) < 1500u)) {
    delay(10);
  }
  Serial.println();
  Serial.println("[mk61ext] boot");
  Serial.print("[mk61ext] lcd pins sck/mosi/cs/dc/rst=");
  Serial.print(kDisplayClockPin);
  Serial.print('/');
  Serial.print(kDisplayDataPin);
  Serial.print('/');
  Serial.print(kDisplayChipSelectPin);
  Serial.print('/');
  Serial.print(kDisplayDataCommandPin);
  Serial.print('/');
  Serial.println(kDisplayResetPin);
  Serial.print("[mk61ext] lcd unused hi-z pins=");
  Serial.print(kUnusedDisplayClockPin);
  Serial.print('/');
  Serial.println(kUnusedDisplayDataPin);
#endif

#if MK61EXT_SERIAL_DEBUG
  Serial.println("[mk61ext] setup: setupDisplay()");
#endif
  setupDisplay();
  setupSupplySense();

  display.clearBuffer();
#if MK61EXT_SERIAL_DEBUG
  Serial.println("[mk61ext] setup: setupEeprom()");
#endif
  setupEeprom();
  loadSettings();
  updateSupplyVoltage(true);
  display.sendBuffer();
  delay(3000);
  calculator.seedRandom(static_cast<uint32_t>(micros()) ^ 0xA5A55A5Au);

  syncPeriodicTickers();
  keyPollTickCount = 1;
  displayRefreshTickCount = 1;
#if MK61EXT_SERIAL_DEBUG
  Serial.println("[mk61ext] setup: done");
#endif
}

void loop() {
  syncPeriodicTickers();

  if (consumeKeyPollTicks() > 0) {
    updateInput();
  }

  updateProgramExecution();

  if (consumeKeyPollTicks() > 0) {
    updateInput();
  }

  updateSupplyVoltage();
  updateIdlePowerState();

  if (consumeDisplayRefreshTicks() > 0) {
    display.clearBuffer();
    if (settingsState.active) {
      drawSettingsScreen();
    } else if (helpState.enabled) {
      drawHelpScreen();
    } else if (programMode) {
      drawProgramScreen();
    } else {
      drawCalculatorScreen();
    }

    sendDisplayIfFrameChanged();
  }
  if (!programRunner.isRunning()) {
    delay(displaySleeping ? kSleepLoopDelayMs : kLoopDelayMs);
  }
}
